//////////////////////////////////////////////////////////////////////////

#include <print>

//////////////////////////////////////////////////////////////////////////

//функция завершает процесс рекурсивного инстансирования- вызывается когда пакет остается пустым
void show_v1() 
{
	std::print("show_v1\n");
}

//////////////////////////////////////////////////////////////////////////
//!!!вариативные шаблоны функций
//Ts - пакет параметров фаблона 
//Ts ... ys - пакет параметров фукции
//это нужно для рекурсивного инстансирования
//пакет это не массив-это сокращенная запись для набора параметров
template < typename T, typename ... Ts > void show_v1(T x, Ts ... ys)
{
	std::print("show_v1 : x = {} sizeof...(ys) = {}\n", x, sizeof...(ys));
	//sizeof... - возвращает размер пакета,а не размер в байтах как sizeof

	show_v1(ys...); // support : cppinsights.io
	//троиточие означает...ys - раскрывай ys как пакет 
}

//////////////////////////////////////////////////////////////////////////

void show_v2(auto x)
{
	std::print("show_v2 : x = {} ", x);
}

//////////////////////////////////////////////////////////////////////////

void show_v2(auto x, auto ... ys)
{
	show_v2(x);

	std::print("sizeof...(ys) = {}\n", sizeof...(ys));

	show_v2(ys...);

	if (sizeof...(ys) == 1)
	{
		std::print("sizeof...(ys) = 0\n");
	}
}

//////////////////////////////////////////////////////////////////////////

void transform(auto ... xs)
{
	show_v1(xs * xs...); // support : cppinsights.io
	//!!!xs * xs... - вариативное выражение
	//show_v1(x1*x1,x2*x2,x3*x3);
}

//////////////////////////////////////////////////////////////////////////

struct Entity 
{
	int x = 0, y = 0;
};

//////////////////////////////////////////////////////////////////////////
//фабричная функция
//???не очень понятно зачем это нужно
auto make_entity(auto ... xs)
{
	return new Entity(xs...);
}

//////////////////////////////////////////////////////////////////////////

int main()
{
	show_v1(1, 2.0, "aaaaa");

	show_v2(1, 2.0, "aaaaa");

//  -------------------------

	transform(1, 2, 3);

//  -------------------------

    delete make_entity(1, 1);
}

//////////////////////////////////////////////////////////////////////////