//////////////////////////////////////////////////////

#include <print>

//////////////////////////////////////////////////////
//!!! критикуется паттерн программистами:
//  создаем статический объект-> его время жизни не контроллируем 
//  не удобная работа с несколькими потоками (если использовать new а не static)
//  какой поток будет создавать singlton 

class Singleton
{
public :

    Singleton            (Singleton const &) = delete;

//  --------------------------------------------------

    Singleton & operator=(Singleton const &) = delete;

//  --------------------------------------------------

    void test() const
    {
        std::print("Singleton::test\n");
    }

//  --------------------------------------------------

    static auto & get()
    {
        static Singleton singleton;

        return singleton;
    }

private :

    Singleton() = default;
};

//////////////////////////////////////////////////////

int main()
{
    Singleton::get().test();
}

//////////////////////////////////////////////////////