//////////////////////////////////

#include <print>

//////////////////////////////////

#include "06.05.hpp"

//////////////////////////////////

void test_v1()
{
	std::print("test_v1\n");
}

//////////////////////////////////
//!!! внешнее связывание
// статическая инициализация 
int g_x1 = 1;
//////////////////////////////////
//!!! динамичесткая инилиацилизация происходит до функции main
// int x = function()
// function вызовется до вызова main
// аналогично может быть с конструктором деструктором и макросом 

//////////////////////////////////
//!!! внутреннее связывание 
// анонимное пространство имен
namespace 
{ 
	[[maybe_unused]] int g_x2 = 2;
}

//////////////////////////////////
//!!! внутреннее связывание 
       int const g_x3 = 3;
//!!! глобальная константа с внешним связыванием 
extern int const g_x4 = 4;

//////////////////////////////////